

 /* * СРОЧНЫЕ И ОБЯЗАТЕЛЬНЫЕ
  * 
  * 1.Доделать механику с энергией и добычей ресурсов (COMPLETED)
* 2. Добавить варианты пополнения энергии(Completed)
 * 2.Сделать механику магазина (пока не доделана механика обучения языка будет достаточно сделать метод и пару строчек) (completed)
 * 3.Сделать механику крафта(completed)
    4.Придумать базис для системы изучения языка(самую простую) (Completed)

5.Сделать уже нормальную механику магазина(но пока что не базовую так как система репутации еще не придумана)
 */

/* 
 * ЧТО НУЖНО ОБЯЗАТЕЛЬНО СДЕЛАТЬ НО НЕ СРОЧНО
 * 
 *  1.Улучшить систему уровней(пока не будет сделана механика кузнеца и нормальная боевая система думаю можно забить хуй,потомучто лвл пока что увеличивает только урон)
 * 2.Попробовать впихнуть уже репутацию(думаю добавить параметр репутации после того как игрок выучит язык на какое то там количество)
 * 3.Блять сделать Южный и Восточный города(пока что хотя бы как полная копия северного города но с другими ресурсами)
 * 4.Ну и конечно что же впихнуть города в БД(вообще думаю не особо и трудно будет)
 * 
 * 5.А вот трудно это реализовать систему ресурсов в городах.Для этого придется и добавить механику трейда и вцелом увеличить колиество ресурсов
 * (но это в/*  ЧТО НУЖНО ДОДЕЛАТЬ/СДЕЛАТЬ В БЛИЖАЙШИЙ СРОК!
се после того как игрок выучит язык так что пока можно забить хуй)
 * 
 * 
 * 
 * 
 * 
 * 
 *     LK = 0 - 20 ничего не понимает,ничего не может в городе
 *     LK = 20 - 50 Может входить в город,торговать и работать у кузнеца
 *     Lk 50 - 100 Появляется система репутации.
 */